; domain
(define (domain air-transport)
(:predicates (plane ?p) (cargo ?c) (airport ?a) (at ?p ?a) (in ?c ?p))

(:action load
 :parameters (?c ?p ?a)
 :precondition (and (cargo ?c)
                    (plane ?p)
                    (airport ?a)
                    (at ?c ?a)
                    (at ?p ?a))
 :effect (and (not (at ?c ?a))
                   (in ?c ?p)) )

(:action unload
 :parameters (?c ?p ?a)
 :precondition (and (cargo ?c)
                    (plane ?p)
                    (airport ?a)
                    (in ?c ?p)
                    (at ?p ?a))
 :effect (and (at ?c ?a)
              (not (in ?c ?p))) )

(:action fly
 :parameters (?p ?from ?to)
 :precondition (and (airport ?from)
                    (airport ?to)
                    (plane ?p)
                    (at ?p ?from))
 :effect (and (not (at ?p ?from))
              (at ?p ?to))) )

; problem
(define (problem air-transport-problem)
(:domain air-transport)
(:objects cargo1 cargo2 SFO JFK plane1 plane2)
(:init (plane plane1)
       (plane plane2)
       (airport SFO)
       (airport JFK)
       (cargo cargo1)
       (cargo cargo2)
       (at cargo1 SFO)
       (at cargo2 JFK)
       (at plane1 SFO)
       (at plane2 JFK))
(:goal (and (at cargo1 JFK)
            (at cargo2 SFO))) )

; plan
1. (load cargo2 plane2 jfk)
   deleted: (at cargo2 jfk)
   added: (in cargo2 plane2)
   goals met: 0 of 2
2. (fly plane2 jfk sfo)
   deleted: (at plane2 jfk)
   added: (at plane2 sfo)
   goals met: 0 of 2
3. (unload cargo2 plane2 sfo)
   deleted: (in cargo2 plane2)
   added: (at cargo2 sfo)
   goals met: 1 of 2
4. (load cargo1 plane2 sfo)
   deleted: (at cargo1 sfo)
   added: (in cargo1 plane2)
   goals met: 1 of 2
5. (fly plane2 sfo jfk)
   deleted: (at plane2 sfo)
   added: (at plane2 jfk)
   goals met: 1 of 2
6. (unload cargo1 plane2 jfk)
   deleted: (in cargo1 plane2)
   added: (at cargo1 jfk)
   goals met: 2 of 2
